In [10]:
import pandas as pd
df = pd.read_csv('Data..csv',index_col = False)

In [11]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [28]:
df2 = df.astype(object).where(pd.notnull(df), None)

In [29]:
df2.head()

   Country Age Salary Purchased
0   France  44  72000        No
1    Spain  27  48000       Yes
2  Germany  30  54000        No
3    Spain  38  61000        No
4  Germany  40   None       Yes

In [30]:
import mysql.connector as msql
from mysql.connector import Error

In [31]:
try:
    conn = msql.connect(host='your host', user='your',  
                        password='yourpwd')
    if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("CREATE DATABASE gkanalytics")
        print("gkanalytics database is created")
except Error as e:
    print("Error while connecting to MySQL", e)

Error while connecting to MySQL 1007 (HY000): Can't create database 'gkanalytics'; database exists

In [32]:
sql ="""CREATE TABLE Test(
   Country VARCHAR(20),
   Age INT(20),
   Salary INT(20),
   Purchased VARCHAR(10)
)"""

In [33]:
try:
    conn = msql.connect(host='your host', 
                           database='your database', user='your users', 
                           password='your pwd')
    if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("You're connected to database: ", record)
        cursor.execute('DROP TABLE IF EXISTS Test;')
        print('Creating table....')
        cursor.execute(sql)
        print("Test table is created....")
        for i,row in df2.iterrows():
            sql = "INSERT INTO gkanalytics.test VALUES (%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            print("Record inserted")
            conn.commit()
except Error as e:
    print("Error while connecting to MySQL", e)

You're connected to database:  ('gkanalytics',)
Creating table....
Test table is created....
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted